---
kind: method
id: M:Autodesk.Revit.DB.SlabShapeCreaseArray.#ctor
source: html/38ef90e1-af91-7aed-c78b-315663caf20d.htm
---
# Autodesk.Revit.DB.SlabShapeCreaseArray.#ctor Method

Initializes a new instance of the SlabShapeCreaseArray class

## Syntax (C#)
```csharp
public SlabShapeCreaseArray()
```